cregeo/openmv/ports/mimxrt/omv_csi.c
/*
 * Copyright (C) 2023-2024 OpenMV, LLC.
 *
 * Redistribution and use in source and binary forms, with or without
 * modification, are permitted provided that the following conditions
 * are met:
 *
 * 1. Redistributions of source code must retain the above copyright
 *    notice, this list of conditions and the following disclaimer.
 * 2. Redistributions in binary form must reproduce the above copyright
 *    notice, this list of conditions and the following disclaimer in
 *    the documentation and/or other materials provided with the
 *    distribution.
 * 3. Any redistribution, use, or modification in source or binary form
 *    is done solely for personal benefit and not for any commercial
 *    purpose or for monetary gain. For commercial licensing options,
 *    please contact openmv@openmv.io
 *
 * THIS SOFTWARE IS PROVIDED BY THE LICENSOR AND COPYRIGHT OWNER "AS IS"
 * AND ANY EXPRESS OR IMPLIED WARRANTIES, INCLUDING, BUT NOT LIMITED TO,
 * THE IMPLIED WARRANTIES OF MERCHANTABILITY AND FITNESS FOR A PARTICULAR
 * PURPOSE ARE DISCLAIMED. IN NO EVENT SHALL THE LICENSOR OR COPYRIGHT
 * OWNER BE LIABLE FOR ANY DIRECT, INDIRECT, INCIDENTAL, SPECIAL,
 * EXEMPLARY, OR CONSEQUENTIAL DAMAGES (INCLUDING, BUT NOT LIMITED TO,
 * PROCUREMENT OF SUBSTITUTE GOODS OR SERVICES; LOSS OF USE, DATA, OR
 * PROFITS; OR BUSINESS INTERRUPTION) HOWEVER CAUSED AND ON ANY THEORY
 * OF LIABILITY, WHETHER IN CONTRACT, STRICT LIABILITY, OR TORT
 * (INCLUDING NEGLIGENCE OR OTHERWISE) ARISING IN ANY WAY OUT OF THE USE
 * OF THIS SOFTWARE, EVEN IF ADVISED OF THE POSSIBILITY OF SUCH DAMAGE.
 *
 * MIMXRT CSI driver.
 */
#if MICROPY_PY_CSI
#include <string.h>
#include <stdint.h>
#include <stdbool.h>
#include "py/mphal.h"

#include "fsl_csi.h"
#include "mimxrt_hal.h"

#include "omv_boardconfig.h"
#include "omv_gpio.h"
#include "omv_i2c.h"
#include "omv_csi.h"
#include "unaligned_memcpy.h"

#define DMA_LENGTH_ALIGNMENT    (8)
#define MIN_EDMA_DST_INC        (4)

extern uint8_t _line_buf[OMV_LINE_BUF_SIZE];

// Experimental: when non-zero, overrides the IMAG_PARA image-height field
// in imx_csi_snapshot() so we can validate small-height DMA framing for
// the evtstream task-3 design. 0 = use the default (csi->one_shot ? fb->v : 1).
// Set/cleared from the GENX320_DEBUG_CAPTURE IOCTL handler.
uint16_t omv_csi_imag_para_height_override = 0;

// Experimental: continuous ping-pong DMA mode for the
// GENX320_DEBUG_CAPTURE_CONTINUOUS IOCTL. When omv_csi_streaming_active is
// true, the CSI IRQ short-circuits the existing SOF / line / frame callback
// chain and instead calls omv_csi_streaming_cb(fb_addr, arg) once per
// FB-done interrupt. Caller (see imx_csi_streaming_start / _stop) is
// responsible for (a) keeping the FB1/FB2 buffers alive, (b) keeping the
// callback IRQ-safe, (c) calling _stop within a bounded time so we don't
// strand the CSI in continuous mode.
volatile bool omv_csi_streaming_active = false;
void (*omv_csi_streaming_cb)(uint8_t *fb_addr, void *arg) = NULL;
void *omv_csi_streaming_arg = NULL;
// Size of each ping-pong FB. Used by the line-callback hook to invalidate
// the D-cache range before handing the buffer to the user callback, so
// the callback sees fresh DMA writes rather than stale cached lines. Set
// at imx_csi_streaming_start() time, cleared by _stop().
uint32_t omv_csi_streaming_fb_size_bytes = 0;

#define CSI_IRQ_FLAGS    (CSI_CR1_SOF_INTEN_MASK            \
                          | CSI_CR1_FB2_DMA_DONE_INTEN_MASK \
                          | CSI_CR1_FB1_DMA_DONE_INTEN_MASK)

int imx_csi_config(omv_csi_t *csi, omv_csi_config_t config) {
    if (config == OMV_CSI_CONFIG_INIT) {
        // Reset and configure CSI.
        CSI_Reset(CSI);
        // CSI_Reset does not zero CR1.
        CSI_REG_CR1(CSI) = 0;
        // CSI mode: HSYNC, VSYNC, and PIXCLK signals are used.
        CSI_REG_CR1(CSI) |= CSI_CR1_GCLK_MODE(1U);
        // Synchronous FIFO clear.
        // RXFIFO and STATFIFO are cleared on every SOF.
        CSI_REG_CR1(CSI) |= CSI_CR1_FCC_MASK;

        // Configure VSYNC, HSYNC and PIXCLK signals.
        CSI_REG_CR1(CSI) |= CSI_CR1_EXT_VSYNC_MASK;
        CSI_REG_CR1(CSI) |= !csi->vsync_pol ? CSI_CR1_SOF_POL_MASK : 0;
        CSI_REG_CR1(CSI) |= !csi->hsync_pol ? CSI_CR1_HSYNC_POL_MASK : 0;
        CSI_REG_CR1(CSI) |= csi->pixck_pol ? CSI_CR1_REDGE_MASK : 0;

        // Stride config: No stride.
        CSI_REG_FBUF_PARA(CSI) = 0;
        // Reset frame counter
        CSI_REG_CR3(CSI) |= CSI_CR3_FRMCNT_RST_MASK;

        // Configure CSI FIFO depth and DMA burst size.
        CSI_REG_CR2(CSI) |= CSI_CR2_DMA_BURST_TYPE_RFF(3U);
        CSI_REG_CR3(CSI) |= 7U << CSI_CR3_RxFF_LEVEL_SHIFT;

        // Write to memory from first completed frame.
        // DMA CSI addr switch at dma transfer done.
        CSI_REG_CR18(CSI) |= CSI_CR18_MASK_OPTION(0);
    }
    return 0;
}

static int imx_csi_abort(omv_csi_t *csi, bool fifo_flush, bool in_irq) {
    // Disable CSI interrupts.
    CSI_DisableInterrupts(CSI, CSI_IRQ_FLAGS);
    NVIC_DisableIRQ(CSI_IRQn);
    NVIC_ClearPendingIRQ(CSI_IRQn);

    CSI_REG_CR3(CSI) &= ~CSI_CR3_DMA_REQ_EN_RFF_MASK;
    CSI_REG_CR18(CSI) &= ~CSI_CR18_CSI_ENABLE_MASK;
    csi->dest_inc = 0;
    return 0;
}

static uint32_t imx_clk_get_frequency(omv_clk_t *clk) {
    return 24000000 / (CLOCK_GetDiv(kCLOCK_CsiDiv) + 1);
}

static int imx_clk_set_frequency(omv_clk_t *clk, uint32_t frequency) {
    if (frequency >= 24000000) {
        CLOCK_SetDiv(kCLOCK_CsiDiv, 0);
    } else if (frequency >= 12000000) {
        CLOCK_SetDiv(kCLOCK_CsiDiv, 1);
    } else if (frequency >= 8000000) {
        CLOCK_SetDiv(kCLOCK_CsiDiv, 2);
    } else if (frequency >= 6000000) {
        CLOCK_SetDiv(kCLOCK_CsiDiv, 3);
    } else if (frequency >= 4000000) {
        CLOCK_SetDiv(kCLOCK_CsiDiv, 5);
    } else {
        CLOCK_SetDiv(kCLOCK_CsiDiv, 7);
    }
    return 0;
}

void omv_csi_sof_callback(omv_csi_t *csi) {
    // Streaming mode short-circuit: FB1/FB2 are pre-set to caller buffers,
    // we just (re)kick the DMA. No framebuffer ring interaction.
    if (omv_csi_streaming_active) {
        CSI_REG_CR3(CSI) |= (CSI_CR3_DMA_REFLASH_RFF_MASK | CSI_CR3_DMA_REQ_EN_RFF_MASK);
        return;
    }

    csi->first_line = false;
    csi->drop_frame = false;

    // Get current framebuffer.
    vbuffer_t *buffer = framebuffer_acquire(csi->fb, FB_FLAG_FREE | FB_FLAG_PEEK);

