cregeo/openmv/ports/mimxrt/omv_csi.c
    if (buffer == NULL) {
        omv_csi_abort(csi, false, true);
        return;
    } else if (csi->one_shot) {
        omv_csi_throttle_framerate(csi);
        if (csi->drop_frame) {
            return;
        }
        CSI_REG_DMASA_FB1(CSI) = (uint32_t) buffer->data;
        CSI_REG_DMASA_FB2(CSI) = (uint32_t) buffer->data;
    } else if (csi->pixformat != PIXFORMAT_JPEG && buffer->offset < csi->resolution[csi->framesize][1]) {
        // Missed a few lines, reset buffer state and continue.
        framebuffer_reset(buffer);
    }

    // Clear the FIFO and re/enable DMA.
    CSI_REG_CR3(CSI) |= (CSI_CR3_DMA_REFLASH_RFF_MASK | CSI_CR3_DMA_REQ_EN_RFF_MASK);
}

#if defined(OMV_CSI_DMA)
int omv_csi_dma_memcpy(omv_csi_t *csi, void *dma, void *dst, void *src, int bpp, bool transposed) {
    edma_handle_t *handle = dma;
    edma_transfer_config_t config;
    framebuffer_t *fb = csi->fb;

    // EMDA will not perform burst transfers for anything less than 32-byte chunks of four 64-bit
    // beats. Additionally, the CSI hardware lacks cropping so we cannot align the source address.
    // Given this, performance will be lacking on cropped images. So much so that we do not use
    // the EDMA for anything less than 4-byte transfers otherwise you get sensor timeout errors.
    if (csi->dest_inc < MIN_EDMA_DST_INC) {
        return -1;
    }

    EDMA_PrepareTransferConfig(&config,
                               src, // srcAddr
                               csi->src_size, // srcWidth
                               csi->src_inc, // srcOffset
                               dst, // destAddr
                               transposed ? bpp : csi->dest_inc, // destWidth
                               transposed ? (fb->v * bpp) : csi->dest_inc, // destOffset
                               fb->u * bpp, // bytesEachRequest
                               fb->u * bpp); // transferBytes

    size_t retry = 3;
    status_t status = kStatus_EDMA_Busy;
    while (status == kStatus_EDMA_Busy) {
        status = EDMA_SubmitTransfer(handle, &config);
        if (status == kStatus_Success) {
            break;
        }
        if (--retry == 0) {
            // Drop the frame if EDMA is not keeping up as the image will be corrupt.
            csi->drop_frame = true;
            return 0;
        }
    }

    EDMA_TriggerChannelStart(handle->base, handle->channel);
    return 0;
}
#endif

void omv_csi_frame_callback(omv_csi_t *csi) {
    // Release the current framebuffer.
    framebuffer_release(csi->fb, FB_FLAG_FREE | FB_FLAG_CHECK_LAST);
    CSI_REG_CR3(CSI) &= ~CSI_CR3_DMA_REQ_EN_RFF_MASK;
    if (csi->frame_cb.fun) {
        csi->frame_cb.fun(csi->frame_cb.arg);
    }
}

void omv_csi_line_callback(omv_csi_t *csi, uint32_t addr) {
    // Streaming mode short-circuit: hand the just-completed FB to the
    // registered callback and return. No framebuffer ring interaction;
    // no EDMA line copy. Runs in CSI IRQ context — keep callback bounded.
    if (omv_csi_streaming_active) {
        if (omv_csi_streaming_cb != NULL) {
            #ifdef __DCACHE_PRESENT
            // CSI DMA writes go straight to physical memory; if the FB
            // lives in a cacheable region (e.g. DRAM via fb_alloc), the
            // CPU may see stale cache lines. Invalidate before handing
            // off, with explicit barriers around the SCB call:
            //   * __DSB() before — drain any in-flight CPU stores so they
            //     don't race the invalidate (defensive — none expected
            //     here, but step 3a's bench_cache discovered that this
            //     barrier matters even when in-theory unnecessary).
            //   * __DSB(); __ISB(); after — ensure invalidate completes
            //     and pipeline is flushed of any speculatively-fetched
            //     stale-cache reads before the user callback runs.
            // CMSIS's SCB_InvalidateDCache_by_Addr inlines the same
            // barriers internally; doubling them is harmless, makes the
            // ordering self-documenting, and forecloses any compiler-
            // reordering hypothesis across the inline boundary.
            __DSB();
            SCB_InvalidateDCache_by_Addr((uint32_t *) addr,
                                         omv_csi_streaming_fb_size_bytes);
            __DSB();
            __ISB();
            #endif
            omv_csi_streaming_cb((uint8_t *) addr, omv_csi_streaming_arg);
        }
        return;
    }

    framebuffer_t *fb = csi->fb;

    // omv_csi_line_callback() will be called at the end of the complete frame in one-shot mode.
    if (csi->one_shot) {
        omv_csi_frame_callback(csi);
        return;
    }

    // Throttle frames to match the current frame rate.
    omv_csi_throttle_framerate(csi);

    // Get current framebuffer.
    vbuffer_t *buffer = framebuffer_acquire(fb, FB_FLAG_FREE | FB_FLAG_PEEK);

    if (csi->pixformat == PIXFORMAT_JPEG) {
        bool jpeg_end = false;

        if (csi->drop_frame) {
            return;
        }

        if (csi->jpg_format == 4) {
            // JPEG MODE 4: Fixed width and height per frame. Each line starts
            // with two bytes indicating valid data length, followed by image
            // data and optional padding (0xFF). `offset` holds the total size.
            uint16_t size = __REV16(*((uint16_t *) addr));
            // Prevent a buffer overflow when writing the jpeg data.
            if (buffer->offset + size > framebuffer_get_buffer_size(fb)) {
                buffer->flags |= VB_FLAG_OVERFLOW;
                jpeg_end = true;
            } else {
                unaligned_memcpy(buffer->data + buffer->offset, ((uint16_t *) addr) + 1, size);
                for (int i = 0; i < size; i++) {
                    int e = buffer->offset + i;
                    int s = IM_MAX(e - 1, 0);
                    if ((buffer->data[s] == 0xFF) && (buffer->data[e] == 0xD9)) {
                        jpeg_end = true;
                        break;
                    }
                }
                buffer->offset += size;
            }
        } else if (csi->jpg_format == 3) {
            // OV2640 JPEG TODO
        }

        // In JPEG mode, the camera will output a number of lines that doesn't
        // match the current frame size. Since we don't have an end-of-frame
        // interrupt on the MIMXRT, the frame ends when there's no more data.
        if (jpeg_end) {
            omv_csi_frame_callback(csi);
            csi->drop_frame = true;
        }
        return;
    }

