cregeo/openmv/ports/mimxrt/omv_csi.c
    if (csi->drop_frame) {
        if (++buffer->offset == csi->resolution[csi->framesize][1]) {
            buffer->offset = 0;
            CSI_REG_CR3(CSI) &= ~CSI_CR3_DMA_REQ_EN_RFF_MASK;
        }
        return;
    }

    if ((fb->y <= buffer->offset) && (buffer->offset < (fb->y + fb->v))) {
        // Copy from DMA buffer to framebuffer.
        uint32_t bytes_per_pixel = omv_csi_get_src_bpp(csi);
        uint8_t *src = ((uint8_t *) addr) + (fb->x * bytes_per_pixel);
        uint8_t *dst = buffer->data;

        // Adjust BPP for Grayscale.
        if (csi->pixformat == PIXFORMAT_GRAYSCALE) {
            bytes_per_pixel = 1;
        }

        if (csi->transpose) {
            dst += bytes_per_pixel * (buffer->offset - fb->y);
        } else {
            dst += fb->u * bytes_per_pixel * (buffer->offset - fb->y);
        }

        #if defined(OMV_CSI_DMA)
        // We're using multiple handles to give each channel the maximum amount of time possible to do the line
        // transfer. In most situations only one channel will be running at a time. However, if SDRAM is
        // backedup we don't have to disable the channel if it is flushing trailing data to SDRAM.
        omv_csi_copy_line(csi, &csi->dma_channels[buffer->offset % OMV_CSI_DMA_CHANNEL_COUNT], src, dst);
        #else
        omv_csi_copy_line(csi, NULL, src, dst);
        #endif
    }

    if (++buffer->offset == csi->resolution[csi->framesize][1]) {
        omv_csi_frame_callback(csi);
    }
}

#if defined(OMV_CSI_DMA)
static void edma_config(omv_csi_t *csi, uint32_t bytes_per_pixel) {
    framebuffer_t *fb = csi->fb;
    uint32_t line_offset_bytes = fb->x * bytes_per_pixel;
    uint32_t line_width_bytes = fb->u * bytes_per_pixel;

    // YUV422 Source -> Y Destination
    if ((csi->pixformat == PIXFORMAT_GRAYSCALE) && (csi->mono_bpp == 2)) {
        line_width_bytes /= 2;
    }

    // Destination will be 32-byte aligned. So, we just need to breakup the line width into the largest
    // power of 2. Source may have an offset which further limits this to a sub power of 2.
    for (int i = 5; i >= 0; i--) {
        // 16-byte burst is not supported.
        if ((i != 4) && (!(line_width_bytes % (1 << i)))) {
            for (int j = i; j >= 0; j--) {
                // 16-byte burst is not supported.
                if ((j != 4) && (!(line_offset_bytes % (1 << j)))) {
                    csi->src_inc = csi->src_size = 1 << j;
                    break;
                }
            }

            csi->dest_inc = 1 << i;
            break;
        }
    }

    if (csi->transpose) {
        csi->dest_inc = bytes_per_pixel;
    }

    // YUV422 Source -> Y Destination
    if ((csi->pixformat == PIXFORMAT_GRAYSCALE) && (csi->mono_bpp == 2)) {
        csi->src_inc = 2;
        csi->src_size = 1;
    }
}
#endif

int imx_csi_snapshot(omv_csi_t *csi, image_t *image, uint32_t flags) {
    vbuffer_t *buffer = NULL;
    framebuffer_t *fb = csi->fb;

    // Configure and re/start the capture if it's not alrady active
    // and there are no pending buffers (from non-blocking capture).
    if (!(CSI->CR18 & CSI_CR18_CSI_ENABLE_MASK) && !framebuffer_readable(fb)) {
        uint32_t bytes_per_pixel = omv_csi_get_src_bpp(csi);
        uint32_t dma_line_bytes = csi->resolution[csi->framesize][0] * bytes_per_pixel;
        uint32_t length = dma_line_bytes * fb->v;

        // Error out if the transfer size is not compatible with DMA transfer restrictions.
        if ((!dma_line_bytes)
            || (dma_line_bytes % sizeof(uint64_t))
            || (dma_line_bytes > (OMV_LINE_BUF_SIZE / 2))
            || (!length)
            || (length % DMA_LENGTH_ALIGNMENT)) {
            return OMV_CSI_ERROR_INVALID_FRAMESIZE;
        }

        #if defined(OMV_CSI_DMA)
        // The code below will enable EDMA data transfer from the line buffer for non-JPEG modes.
        if (csi->pixformat != PIXFORMAT_JPEG) {
            edma_config(csi, bytes_per_pixel);
            for (int i = 0; i < OMV_CSI_DMA_CHANNEL_COUNT; i++) {
                EDMA_CreateHandle(&csi->dma_channels[i], OMV_CSI_DMA, OMV_CSI_DMA_CHANNEL_START + i);
                EDMA_DisableChannelInterrupts(OMV_CSI_DMA,
                                              OMV_CSI_DMA_CHANNEL_START + i,
                                              kEDMA_MajorInterruptEnable);
            }
        }
        #endif

        if ((csi->pixformat == PIXFORMAT_RGB565 && csi->rgb_swap) ||
            (csi->pixformat == PIXFORMAT_YUV422 && csi->yuv_swap)) {
            CSI_REG_CR1(CSI) |= CSI_CR1_SWAP16_EN_MASK | CSI_CR1_PACK_DIR_MASK;
        } else {
            CSI_REG_CR1(CSI) &= ~(CSI_CR1_SWAP16_EN_MASK | CSI_CR1_PACK_DIR_MASK);
        }

        csi->one_shot = csi->pixformat != PIXFORMAT_JPEG &&
                        !csi->transpose && !omv_csi_get_cropped(csi) &&
                        !(csi->pixformat == PIXFORMAT_GRAYSCALE && csi->mono_bpp == 2);

        // Configure DMA buffers.
        CSI_REG_DMASA_FB1(CSI) = (uint32_t) (&_line_buf[OMV_LINE_BUF_SIZE * 0]);
        CSI_REG_DMASA_FB2(CSI) = (uint32_t) (&_line_buf[OMV_LINE_BUF_SIZE / 2]);
        uint16_t imag_para_height = csi->one_shot ? fb->v : 1;
        if (omv_csi_imag_para_height_override != 0) {
            imag_para_height = omv_csi_imag_para_height_override;
        }
        CSI_REG_IMAG_PARA(CSI) =
            (dma_line_bytes << CSI_IMAG_PARA_IMAGE_WIDTH_SHIFT) |
            (imag_para_height << CSI_IMAG_PARA_IMAGE_HEIGHT_SHIFT);

        // Enable CSI interrupts.
        CSI_EnableInterrupts(CSI, CSI_IRQ_FLAGS);
        NVIC_ClearPendingIRQ(CSI_IRQn);
        NVIC_SetPriority(CSI_IRQn, IRQ_PRI_CSI);
        NVIC_EnableIRQ(CSI_IRQn);

        // Enable CSI
        CSI_REG_CR18(CSI) |= CSI_CR18_CSI_ENABLE_MASK;
    }

    framebuffer_flags_t fb_flags = FB_FLAG_USED | FB_FLAG_PEEK;

    #if defined(OMV_CSI_DMA)
    // If the EDMA is used, the transfers must be invalidated.
    if (csi->dest_inc >= MIN_EDMA_DST_INC) {
        fb_flags |= FB_FLAG_INVALIDATE;
    }
    #endif

    // Wait for a frame to be ready.
    for (mp_uint_t start = mp_hal_ticks_ms(); ; mp_event_handle_nowait()) {
        if ((buffer = framebuffer_acquire(fb, fb_flags))) {
            break;
        }

        if (flags & OMV_CSI_FLAG_NON_BLOCK) {
            return OMV_CSI_ERROR_WOULD_BLOCK;
        }

