cregeo/openmv/ports/mimxrt/omv_csi.c
        if ((mp_hal_ticks_ms() - start) > OMV_CSI_TIMEOUT_MS) {
            omv_csi_abort(csi, true, false);
            return OMV_CSI_ERROR_CAPTURE_TIMEOUT;
        }
    }

    // The JPEG in the frame buffer is actually invalid.
    if (buffer->flags & VB_FLAG_OVERFLOW) {
        return OMV_CSI_ERROR_JPEG_OVERFLOW;
    }

    // Set the framebuffer width/height.
    fb->w = csi->transpose ? fb->v : fb->u;
    fb->h = csi->transpose ? fb->u : fb->v;

    // Set the framebuffer pixel format.
    switch (csi->pixformat) {
        case PIXFORMAT_GRAYSCALE:
            fb->pixfmt = PIXFORMAT_GRAYSCALE;
            break;
        case PIXFORMAT_RGB565:
            fb->pixfmt = PIXFORMAT_RGB565;
            break;
        case PIXFORMAT_BAYER:
            fb->pixfmt = PIXFORMAT_BAYER;
            fb->subfmt_id = csi->cfa_format;
            fb->pixfmt = imlib_bayer_shift(fb->pixfmt, fb->x, fb->y, csi->transpose);
            break;
        case PIXFORMAT_YUV422: {
            fb->pixfmt = PIXFORMAT_YUV;
            fb->subfmt_id = csi->yuv_format;
            fb->pixfmt = imlib_yuv_shift(fb->pixfmt, fb->x);
            break;
        }
        case PIXFORMAT_JPEG: {
            int32_t size = 0;
            if (csi->chip_id == OV5640_ID) {
                // Offset contains the sum of all the bytes transferred from the offset buffers
                // while in omv_csi_line_callback().
                size = buffer->offset;
            } else {
                // OV2640 JPEG TODO
            }
            // Clean trailing data after 0xFFD9 at the end of the jpeg byte stream.
            fb->pixfmt = PIXFORMAT_JPEG;
            fb->size = jpeg_clean_trailing_bytes(size, buffer->data);
            break;
        }
        default:
            break;
    }

    // Set the user image.
    framebuffer_to_image(fb, image);
    return 0;
}

int omv_csi_ops_init(omv_csi_t *csi) {
    // Set CSI ops.
    csi->abort = imx_csi_abort;
    csi->config = imx_csi_config;
    csi->snapshot = imx_csi_snapshot;

    // Set CSI clock ops.
    csi->clk->freq = OMV_CSI_CLK_FREQUENCY;
    csi->clk->set_freq = imx_clk_set_frequency;
    csi->clk->get_freq = imx_clk_get_frequency;
    return 0;
}

// Experimental: continuous ping-pong DMA mode for the
// GENX320_DEBUG_CAPTURE_CONTINUOUS validation IOCTL.
//
// Configures the i.MX CSI peripheral with `IMAG_PARA` height = `height_lines`
// and `dma_line_bytes` width, points FB1 / FB2 at the caller buffers, and
// installs `cb` as the per-FB-done IRQ handler. CSI runs continuously
// without ever entering the off-time of the snapshot lifecycle.
//
// Caller must:
//   - hold fb1 / fb2 alive until imx_csi_streaming_stop() returns
//   - keep `cb` IRQ-safe and bounded in runtime
//   - have aborted any prior CSI activity before calling
//   - call imx_csi_streaming_stop() within a bounded window
int imx_csi_streaming_start(omv_csi_t *csi,
                            uint8_t *fb1, uint8_t *fb2,
                            uint16_t dma_line_bytes,
                            uint16_t height_lines,
                            void (*cb)(uint8_t *fb_addr, void *arg),
                            void *arg) {
    if (omv_csi_streaming_active) {
        return OMV_CSI_ERROR_CTL_FAILED;
    }
    if (cb == NULL || fb1 == NULL || fb2 == NULL ||
        dma_line_bytes == 0 || height_lines == 0) {
        return OMV_CSI_ERROR_INVALID_ARGUMENT;
    }
    uint32_t total = (uint32_t) dma_line_bytes * (uint32_t) height_lines;
    if (total % DMA_LENGTH_ALIGNMENT) {
        return OMV_CSI_ERROR_INVALID_FRAMESIZE;
    }

    // Reset CSI to a known state. Sub-call to imx_csi_abort first so the
    // peripheral isn't running when we touch IMAG_PARA / DMASA registers.
    omv_csi_abort(csi, true, false);

    // Configure DMA addresses and image dimensions.
    CSI_REG_DMASA_FB1(CSI) = (uint32_t) fb1;
    CSI_REG_DMASA_FB2(CSI) = (uint32_t) fb2;
    CSI_REG_IMAG_PARA(CSI) =
        (((uint32_t) dma_line_bytes) << CSI_IMAG_PARA_IMAGE_WIDTH_SHIFT) |
        (((uint32_t) height_lines) << CSI_IMAG_PARA_IMAGE_HEIGHT_SHIFT);

    // No EDMA line copy in streaming mode — we read events out of FB1/FB2
    // directly in the callback. Set dest_inc = 0 as a sentinel.
    csi->dest_inc = 0;
    csi->one_shot = false;

    // Install the callback last, so a stray IRQ before this point doesn't
    // jump through a half-initialized hook.
    omv_csi_streaming_cb = cb;
    omv_csi_streaming_arg = arg;
    omv_csi_streaming_fb_size_bytes = total;
    __DSB();
    omv_csi_streaming_active = true;

    // Enable CSI interrupts (SOF + FB1_done + FB2_done) and start CSI.
    CSI_EnableInterrupts(CSI, CSI_IRQ_FLAGS);
    NVIC_ClearPendingIRQ(CSI_IRQn);
    NVIC_SetPriority(CSI_IRQn, IRQ_PRI_CSI);
    NVIC_EnableIRQ(CSI_IRQn);
    CSI_REG_CR18(CSI) |= CSI_CR18_CSI_ENABLE_MASK;

    return 0;
}

void imx_csi_streaming_stop(omv_csi_t *csi) {
    // Clear active flag first so any in-flight CSI IRQ that fires during
    // the abort sequence falls through cleanly without calling our cb.
    omv_csi_streaming_active = false;
    __DSB();

    // Tear down CSI; reuses the existing abort path so other state stays
    // consistent (NVIC, DMA enable bit, etc).
    omv_csi_abort(csi, true, false);

    omv_csi_streaming_cb = NULL;
    omv_csi_streaming_arg = NULL;
    omv_csi_streaming_fb_size_bytes = 0;
}
#endif // MICROPY_PY_CSI
